node {
  name: "place_holder_for_creative_merge_op_1"
  op: "Placeholder"
  device: "/CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "indicator_ad_all_creativeid_indices"
  op: "IndicatorOp"
  input: "place_holder_for_creative_merge_op_1"
  device: "/CPU:0"
  attr {
    key: "Tout"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "place_holder_for_unique_ad_cate_id_keys_1"
  op: "Placeholder"
  device: "/CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "place_holder_for_SparseTensorPackOp_0"
  op: "Placeholder"
  device: "/CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "place_holder_for_ext_biz_0"
  op: "Placeholder"
  device: "/CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "RapidEmbeddingOpV2_1"
  op: "RapidEmbeddingOpV2"
  input: "place_holder_for_SparseTensorPackOp_0"
  input: "indicator_ad_all_creativeid_indices"
  input: "place_holder_for_ext_biz_0"
  device: "/CPU:0"
  attr {
    key: "Tin"
    value {
      list {
        type: DT_STRING
        type: DT_INT64
        type: DT_STRING
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_HALF
        type: DT_HALF
        type: DT_HALF
        type: DT_HALF
        type: DT_HALF
        type: DT_HALF
        type: DT_HALF
        type: DT_HALF
        type: DT_HALF
        type: DT_HALF
        type: DT_HALF
        type: DT_HALF
        type: DT_HALF
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "embed_json"
    value {
      s: "{\"feature_source\": {\"output_type_suffix\": {\"indices\": \"_indices\", \"keys\": \"_keys\", \"values\": \"_values\"}, \"ad_creative_source_name\": \"k2_hash_nmd\", \"feature_desc\": [{\"select_fields\": [\"adgroup_id\", \"campaign_id\", \"member_id\", \"ad_item_id\", \"ad_cate_id\", \"ad_shop_id\", \"ad_node_id\", \"ad_item_user_type\", \"ad_item_city\", \"ad_item_prov\", \"ad_item_product\", \"ad_item_brand\", \"ad_title_topn\", \"cate_level2_id\", \"swing_item_rtpkv\", \"swing_cate_rtpkv\", \"swing_shop_rtpkv\", \"swing_node_rtpkv\", \"main_cate_level1_id\", \"main_cate_level2_id\", \"main_cate_leaf_id\", \"clk_id_age_level_agg_rtpkv\", \"clk_id_gender_agg_rtpkv\", \"clk_user_layer_agg_rtpkv\", \"clk_activity_agg_rtpkv\", \"pv_top_property\", \"tree_path\", \"ad_ctr1\", \"ad_ctr3\", \"ad_ctr7\", \"shop_ctr1\", \"shop_ctr3\", \"shop_ctr7\", \"ad_clk1\", \"ad_clk3\", \"ad_clk7\", \"shop_clk1\", \"shop_clk3\", \"shop_clk7\", \"item_ctr1\", \"item_ctr7\", \"item_ctr14\", \"item_ctr30\", \"item_sel_ctr1\", \"item_sel_ctr7\", \"item_sel_ctr14\", \"item_sel_ctr30\", \"item_cvr1\", \"item_cvr7\", \"item_cvr14\", \"item_cvr30\", \"item_sel_cvr1\", \"item_sel_cvr7\", \"item_sel_cvr14\", \"item_sel_cvr30\", \"ad_all_creativeid\", \"product_type\", \"sub_product_type\"], \"key\": \"adgroup_id\", \"from_table\": \"k2_hash_nmd\"}, {\"select_fields\": [\"pid\"], \"from_table\": \"context\"}, {\"select_fields\": [\"bh_item_seq\", \"bh_node_seq\", \"bh_shop_seq\", \"bh_brand_seq\", \"bh_product_seq\", \"bh_ds_seq2\"], \"tair_igraph_table\": {\"nick_cate_table\": [\"fund_mlr_n_user_lt_cate_hash_igraph\"]}, \"from_table\": \"nick_cate\"}, {\"select_fields\": [\"rt_pv_item_seq\", \"rt_pv_cate_seq\", \"rt_pv_node_seq\", \"rt_pv_shop_seq\", \"rt_pv_brand_seq\", \"rt_pv_product_seq\", \"rt_pv_item\", \"rt_pv_cate\", \"rt_pv_shop\", \"rt_pv_node\", \"hot_nick\", \"not_hot_nick\", \"nick_scene_ad_clk_item_14\", \"nick_scene_ad_clk_item_30\", \"nick_scene_ad_clk_item_60\", \"nick_scene_ad_clk_cate_14\", \"nick_scene_ad_clk_cate_30\", \"nick_scene_ad_clk_cate_60\", \"nick_scene_ad_clk_node_14\", \"nick_scene_ad_clk_node_30\", \"nick_scene_ad_clk_node_60\", \"nick_scene_ad_clk_shop_14\", \"nick_scene_ad_clk_shop_30\", \"nick_scene_ad_clk_shop_60\", \"nick_scene_ad_clk_brand_14\", \"nick_scene_ad_clk_brand_30\", \"nick_scene_ad_clk_brand_60\", \"nick_scene_ad_clk_product_14\", \"nick_scene_ad_clk_product_30\", \"nick_scene_ad_clk_product_60\", \"nick_scene_ad_clk_adgroup_14\", \"nick_scene_ad_clk_adgroup_30\", \"nick_scene_ad_clk_adgroup_60\", \"nick_item_fav_180\", \"nick_cate_fav_180\", \"nick_node_fav_180\", \"nick_shop_fav_180\", \"nick_item_cart_180\", \"nick_cate_cart_180\", \"nick_node_cart_180\", \"nick_shop_cart_180\", \"nick_item_buy_180\", \"nick_cate_buy_180\", \"nick_node_buy_180\", \"nick_shop_buy_180\", \"nick_brand_buy_180\", \"nick_product_buy_180\", \"nick_scene_ad_nonclk_item_30\", \"nick_scene_ad_nonclk_cate_30\", \"nick_scene_ad_nonclk_node_30\", \"nick_scene_ad_nonclk_shop_30\", \"nick_scene_ad_nonclk_brand_30\", \"nick_scene_ad_nonclk_product_30\", \"nick_scene_ad_nonclk_adgroup_30\", \"nick_scene_ad_nonclk_seq_item_30\", \"nick_scene_ad_nonclk_seq_cate_30\", \"nick_scene_ad_nonclk_seq_node_30\", \"nick_scene_ad_nonclk_seq_shop_30\", \"nick_scene_ad_nonclk_seq_brand_30\", \"nick_scene_ad_nonclk_seq_product_30\", \"nick_ad_clk_item_14\", \"nick_ad_clk_item_30\", \"nick_ad_clk_item_60\", \"nick_ad_clk_cate_14\", \"nick_ad_clk_cate_30\", \"nick_ad_clk_cate_60\", \"nick_ad_clk_node_14\", \"nick_ad_clk_node_30\", \"nick_ad_clk_node_60\", \"nick_ad_clk_shop_14\", \"nick_ad_clk_shop_30\", \"nick_ad_clk_shop_60\", \"nick_ad_clk_brand_14\", \"nick_ad_clk_brand_30\", \"nick_ad_clk_brand_60\", \"nick_ad_clk_product_14\", \"nick_ad_clk_product_30\", \"nick_ad_clk_product_60\", \"nick_ad_clk_adgroup_14\", \"nick_ad_clk_adgroup_30\", \"nick_ad_clk_adgroup_60\", \"nick_ad_nonclk_item_30\", \"nick_ad_nonclk_cate_30\", \"nick_ad_nonclk_node_30\", \"nick_ad_nonclk_shop_30\", \"nick_ad_nonclk_brand_30\", \"nick_ad_nonclk_product_30\", \"nick_ad_nonclk_adgroup_30\", \"nick_ad_nonclk_seq_item_30\", \"nick_ad_nonclk_seq_cate_30\", \"nick_ad_nonclk_seq_node_30\", \"nick_ad_nonclk_seq_shop_30\", \"id_age_level\", \"id_gender\", \"prov_name\", \"city_name\", \"city_level\", \"buyer_star_name\", \"vip_level_name\", \"cms_segid\", \"cms_group_id\", \"shopping_level\", \"pred_is_undergraduate\", \"phone_model\", \"l1cat_prefer_long\", \"pred_has_house\", \"leafcate_prefer_long\", \"pred_life_stage_haschild\", \"pred_life_stage_married\", \"pred_career_type\", \"shop_prefer_3days\", \"shop_prefer_long\", \"tm_level\", \"user_pp_level\", \"phone_price\", \"phone_price_level_prefer\", \"pred_attending_college\", \"user_layer_level\", \"brand_prefer_long\", \"groups_prefer\", \"bc_prefer\", \"purchase_total\", \"user_layer\", \"activity\", \"activity_gul\", \"item_seq_21\", \"cate_seq_21\", \"node_seq_21\", \"shop_seq_21\", \"brand_seq_21\", \"product_seq_21\", \"dsdecay_seq_21\", \"seqpos_seq_21\", \"nick_item_pv_14\", \"nick_cate_pv_14\", \"nick_node_pv_14\", \"nick_shop_pv_14\", \"nick_brand_pv_14\", \"nick_product_pv_14\", \"nick_cate_fav_14\", \"nick_cate_buy_14\", \"nick_cate_cart_14\", \"cnxh_item_seq_45\", \"cnxh_cate_seq_45\", \"cnxh_node_seq_45\", \"cnxh_shop_seq_45\", \"cnxh_brand_seq_45\", \"cnxh_product_seq_45\", \"cnxh_dsdecay_seq_45\", \"cnxh_seqpos_seq_45\", \"gouhou_item_seq_60\", \"gouhou_cate_seq_60\", \"gouhou_node_seq_60\", \"gouhou_shop_seq_60\", \"gouhou_brand_seq_60\", \"gouhou_product_seq_60\", \"gouhou_cate_level2_seq_60\", \"gouhou_shop_main_cate_seq_60\", \"gouhou_shop_main2_cate_seq_60\", \"scene_item_seq_21\", \"scene_cate_seq_21\", \"scene_node_seq_21\", \"scene_shop_seq_21\", \"scene_brand_seq_21\", \"scene_product_seq_21\", \"scene_cate_level2_seq_21\", \"scene_shop_main_cate_seq_21\", \"scene_shop_main2_cate_seq_21\", \"clk_word_weight\", \"nonclk_word_weight\", \"noclk_adlist\", \"nick_hashnode_pv_14\", \"ub_ucm_cate_3\", \"ub_ucm_cate_5\", \"ub_ucm_cate_7\", \"ub_ucm_cate_14\", \"ub_ucm_shop_14\", \"nick_scene_ad_clk_item_30_swing\", \"nick_scene_ad_clk_item_60_swing\", \"nick_scene_ad_nonclk_item_30_swing\", \"cnxh_item_seq_45_swing\", \"gouhou_item_seq_60_swing\", \"nick_ad_clk_item_30_swing\", \"nick_ad_clk_item_60_swing\", \"item_seq_21_swing\", \"nick_item_pv_21_swing\"], \"tair_igraph_table\": {\"nick_stag_kkv_table\": [\"nohash_kkv_k2_scence_cg_ds_igraph\"], \"nick_table\": [\"nohash_nick_k2_all_ds_igraph\", \"nohash_nick_k2_seq_ds_igraph\", \"nohash_nick_k2_agg_profile_ds_igraph\", \"global_nick_ub_ds\", \"global_nick_rtb_seq\", \"rt_ub_50_seq\", \"rt_ub_pv_igraph\", \"rt_ub_pv_agg_igraph\"]}, \"from_table\": \"user\"}, {\"select_fields\": [\"rt_pv_in_3\", \"rt_pv_in_6\", \"rt_pv_in_9\", \"rt_pv_in_12\", \"rt_clk_in_3\", \"rt_clk_in_6\", \"rt_clk_in_9\", \"rt_clk_in_12\", \"rt_clk_till_now\", \"rt_ctr_till_now\", \"rt_pv_in_3_mock_dense\", \"rt_pv_in_6_mock_dense\", \"rt_pv_in_9_mock_dense\", \"rt_pv_in_12_mock_dense\", \"rt_clk_in_3_mock_dense\", \"rt_clk_in_6_mock_dense\", \"rt_clk_in_9_mock_dense\"], \"from_table\": \"k2_ad_realtime_hash\"}]}, \"features\": [{\"parse_function\": \"parse_id\", \"feature_name\": \"adgroup_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"201\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"campaign_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"203\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"member_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"204\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_item_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"205\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_cate_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"206\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_shop_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"207\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_node_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"208\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_item_user_type\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"212\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_item_city\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"213\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_item_prov\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"214\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_item_product\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"215\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_item_brand\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"216\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_title_topn\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"219\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"cate_level2_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"223\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"swing_item_rtpkv\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"230\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"swing_cate_rtpkv\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"231\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"swing_shop_rtpkv\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"232\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"swing_node_rtpkv\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"233\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"main_cate_level1_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"234\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"main_cate_level2_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"235\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"main_cate_leaf_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"236\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"clk_id_age_level_agg_rtpkv\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"278_1\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"clk_id_gender_agg_rtpkv\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"279_1\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"clk_user_layer_agg_rtpkv\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"281_1\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"clk_activity_agg_rtpkv\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"282_1\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"pv_top_property\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1910\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"tree_path\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1911\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_ctr1\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"240_1\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_ctr3\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"240_3\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_ctr7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"240_7\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"shop_ctr1\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"241_1\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"shop_ctr3\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"241_3\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"shop_ctr7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"241_7\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_clk1\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"242_1\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_clk3\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"242_3\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_clk7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"242_7\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"shop_clk1\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"243_1\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"shop_clk3\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"243_3\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"shop_clk7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"243_7\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_ctr1\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"244_1\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_ctr7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"244_7\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_ctr14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"244_14\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_ctr30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"244_30\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_sel_ctr1\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"245_1\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_sel_ctr7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"245_7\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_sel_ctr14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"245_14\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_sel_ctr30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"245_30\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_cvr1\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"246_1\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_cvr7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"246_7\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_cvr14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"246_14\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_cvr30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"246_30\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_sel_cvr1\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"247_1\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_sel_cvr7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"247_7\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_sel_cvr14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"247_14\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"item_sel_cvr30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"247_30\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_all_creativeid\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"861\", \"fg_table\": \"creative\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"pid\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"301\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"bh_item_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"150_180\", \"fg_table\": \"cate\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"bh_node_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"152_180\", \"fg_table\": \"cate\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"bh_shop_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"153_180\", \"fg_table\": \"cate\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"bh_brand_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"154_180\", \"fg_table\": \"cate\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"bh_product_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"155_180\", \"fg_table\": \"cate\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"bh_ds_seq2\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"150_113\", \"fg_table\": \"cate\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"rt_pv_item_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"180_1\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"rt_pv_cate_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"181_1\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"rt_pv_node_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"182_1\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"rt_pv_shop_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"183_1\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"rt_pv_brand_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"184_1\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"rt_pv_product_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"185_1\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"rt_pv_item\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"141_0\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"rt_pv_cate\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"141_1\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"rt_pv_shop\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"141_2\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"rt_pv_node\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"141_3\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_pv_in_3\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"266_3\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_pv_in_6\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"266_6\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_pv_in_9\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"266_9\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_pv_in_12\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"266_12\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_clk_in_3\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"265_3\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_clk_in_6\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"265_6\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_clk_in_9\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"265_9\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_clk_in_12\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"265_12\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_clk_till_now\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"265_0\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_ctr_till_now\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"267\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_pv_in_3_mock_dense\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"2660_3\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_pv_in_6_mock_dense\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"2660_6\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_pv_in_9_mock_dense\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"2660_9\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_pv_in_12_mock_dense\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"2660_12\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_clk_in_3_mock_dense\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"2650_3\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_clk_in_6_mock_dense\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"2650_6\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"rt_clk_in_9_mock_dense\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"2650_9\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"hot_nick\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"101_1\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"not_hot_nick\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"101_2\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_item_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1100_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_item_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1100_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_item_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1100_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_cate_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1101_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_cate_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1101_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_cate_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1101_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_node_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1102_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_node_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1102_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_node_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1102_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_shop_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1103_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_shop_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1103_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_shop_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1103_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_brand_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1104_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_brand_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1104_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_brand_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1104_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_product_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1105_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_product_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1105_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_product_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1105_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_adgroup_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1107_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_adgroup_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1107_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_clk_adgroup_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1107_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_item_fav_180\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1700_180\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_cate_fav_180\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1701_180\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_node_fav_180\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1702_180\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_shop_fav_180\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1703_180\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_item_cart_180\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1710_180\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_cate_cart_180\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1711_180\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_node_cart_180\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1712_180\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_shop_cart_180\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1713_180\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_item_buy_180\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1720_180\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_cate_buy_180\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1721_180\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_node_buy_180\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1722_180\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_shop_buy_180\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1723_180\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_brand_buy_180\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1724_180\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_product_buy_180\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1725_180\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_nonclk_item_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1120_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_nonclk_cate_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1121_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_nonclk_node_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1122_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_nonclk_shop_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1123_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_nonclk_brand_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1124_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_nonclk_product_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1125_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_scene_ad_nonclk_adgroup_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1127_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"nick_scene_ad_nonclk_seq_item_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1130_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"nick_scene_ad_nonclk_seq_cate_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1131_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"nick_scene_ad_nonclk_seq_node_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1132_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"nick_scene_ad_nonclk_seq_shop_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1133_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"nick_scene_ad_nonclk_seq_brand_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1134_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"nick_scene_ad_nonclk_seq_product_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1135_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_item_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1200_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_item_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1200_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_item_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1200_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_cate_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1201_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_cate_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1201_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_cate_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1201_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_node_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1202_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_node_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1202_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_node_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1202_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_shop_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1203_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_shop_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1203_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_shop_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1203_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_brand_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1204_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_brand_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1204_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_brand_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1204_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_product_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1205_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_product_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1205_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_product_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1205_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_adgroup_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1207_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_adgroup_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1207_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_clk_adgroup_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1207_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_nonclk_item_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1220_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_nonclk_cate_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1221_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_nonclk_node_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1222_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_nonclk_shop_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1223_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_nonclk_brand_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1224_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_nonclk_product_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1225_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_ad_nonclk_adgroup_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1227_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"nick_ad_nonclk_seq_item_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1230_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"nick_ad_nonclk_seq_cate_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1231_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"nick_ad_nonclk_seq_node_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1232_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"nick_ad_nonclk_seq_shop_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1233_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"id_age_level\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_1\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"id_gender\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_2\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"prov_name\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_3\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"city_name\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_4\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"city_level\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_5\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"buyer_star_name\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_6\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"vip_level_name\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_7\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"cms_segid\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_8\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"cms_group_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_9\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"shopping_level\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_10\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"pred_is_undergraduate\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_11\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"phone_model\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_12\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"l1cat_prefer_long\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_13\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"pred_has_house\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"leafcate_prefer_long\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_15\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"pred_life_stage_haschild\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_16\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"pred_life_stage_married\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_17\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"pred_career_type\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_18\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"shop_prefer_3days\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_19\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"shop_prefer_long\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_20\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"tm_level\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_21\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"user_pp_level\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_22\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"phone_price\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_23\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"phone_price_level_prefer\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_24\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"pred_attending_college\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_25\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"user_layer_level\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_26\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"brand_prefer_long\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_27\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"groups_prefer\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_28\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"bc_prefer\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_29\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"purchase_total\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"user_layer\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_31\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"activity\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_32\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"activity_gul\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"130_33\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"item_seq_21\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"150_21\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"cate_seq_21\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"151_21\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"node_seq_21\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"152_21\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"shop_seq_21\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"153_21\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"brand_seq_21\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"154_21\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"product_seq_21\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"155_21\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"dsdecay_seq_21\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"159_21\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"seqpos_seq_21\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"159_1_21\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_item_pv_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1510_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_cate_pv_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1511_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_node_pv_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1512_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_shop_pv_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1513_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_brand_pv_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1514_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_product_pv_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1515_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_cate_fav_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1521_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_cate_buy_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1522_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_cate_cart_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1523_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"cnxh_item_seq_45\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"160_45\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"cnxh_cate_seq_45\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"161_45\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"cnxh_node_seq_45\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"162_45\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"cnxh_shop_seq_45\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"163_45\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"cnxh_brand_seq_45\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"164_45\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"cnxh_product_seq_45\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"165_45\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"cnxh_dsdecay_seq_45\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"169_45\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"cnxh_seqpos_seq_45\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"169_1_45\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"gouhou_item_seq_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1610_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"gouhou_cate_seq_60\", 