node {
  name: "nick_name"
  op: "Placeholder"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "AdIGraphAsyncAccessOpV2_2"
  op: "AdIGraphAsyncAccessOpV2"
  input: "nick_name"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "ds_conf_key"
    value {
      list {
        s: "IGRAPH_nohash_nick_k2_agg_profile_ds_igraph"
      }
    }
  }
}
node {
  name: "AdTairAsyncAccessOp"
  op: "AdTairAsyncAccessOp"
  input: "nick_name"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "ds_conf_key"
    value {
      s: "TAIR_global_nick_ub_ds"
    }
  }
  attr {
    key: "fea_list"
    value {
      s: ""
    }
  }
}
node {
  name: "AdTairAsyncAccessOp_1"
  op: "AdTairAsyncAccessOp"
  input: "nick_name"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "ds_conf_key"
    value {
      s: "TAIR_global_nick_rtb_seq"
    }
  }
  attr {
    key: "fea_list"
    value {
      s: ""
    }
  }
}
node {
  name: "AdTairAsyncAccessOp_2"
  op: "AdTairAsyncAccessOp"
  input: "nick_name"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "ds_conf_key"
    value {
      s: "TAIR_rt_ub_50_seq"
    }
  }
  attr {
    key: "fea_list"
    value {
      s: ""
    }
  }
}
node {
  name: "AdIGraphAsyncAccessOpV2_3"
  op: "AdIGraphAsyncAccessOpV2"
  input: "nick_name"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "ds_conf_key"
    value {
      list {
        s: "IGRAPH_rt_ub_pv_igraph"
      }
    }
  }
}
node {
  name: "AdIGraphAsyncAccessOpV2_4"
  op: "AdIGraphAsyncAccessOpV2"
  input: "nick_name"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "ds_conf_key"
    value {
      list {
        s: "IGRAPH_rt_ub_pv_agg_igraph"
      }
    }
  }
}
node {
  name: "AdIGraphAsyncAccessOpV2"
  op: "AdIGraphAsyncAccessOpV2"
  input: "nick_name"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "ds_conf_key"
    value {
      list {
        s: "IGRAPH_nohash_nick_k2_all_ds_igraph"
      }
    }
  }
}
node {
  name: "AdIGraphAsyncAccessOpV2_1"
  op: "AdIGraphAsyncAccessOpV2"
  input: "nick_name"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "ds_conf_key"
    value {
      list {
        s: "IGRAPH_nohash_nick_k2_seq_ds_igraph"
      }
    }
  }
}
node {
  name: "IGRAPH_nohash_nick_k2_agg_profile_ds_igraph"
  op: "UbParseOpV2"
  input: "AdIGraphAsyncAccessOpV2_2"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "TAIR_global_nick_ub_ds"
  op: "UbParseOpV2"
  input: "AdTairAsyncAccessOp"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "TAIR_global_nick_rtb_seq"
  op: "UbParseOpV2"
  input: "AdTairAsyncAccessOp_1"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "TAIR_rt_ub_50_seq"
  op: "UbParseOpV2"
  input: "AdTairAsyncAccessOp_2"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "IGRAPH_rt_ub_pv_igraph"
  op: "UbParseOpV2"
  input: "AdIGraphAsyncAccessOpV2_3"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "IGRAPH_rt_ub_pv_agg_igraph"
  op: "UbParseOpV2"
  input: "AdIGraphAsyncAccessOpV2_4"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "refpid"
  op: "Placeholder"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "timestamp"
  op: "Placeholder"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_UINT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "session_id"
  op: "Placeholder"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "IGRAPH_nohash_nick_k2_all_ds_igraph"
  op: "UbParseOpV2"
  input: "AdIGraphAsyncAccessOpV2"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "pid"
  op: "Placeholder"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "IGRAPH_nohash_nick_k2_seq_ds_igraph"
  op: "UbParseOpV2"
  input: "AdIGraphAsyncAccessOpV2_1"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "PidToStagOp"
  op: "PidToStagOp"
  input: "pid"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "conf"
    value {
      s: ""
    }
  }
}
node {
  name: "AdKkvIGraphAsyncAccessOp"
  op: "AdKkvIGraphAsyncAccessOp"
  input: "nick_name"
  input: "PidToStagOp"
  device: "/CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "ds_conf_key"
    value {
      list {
        s: "IGRAPH_nohash_kkv_k2_scence_ds_igraph"
      }
    }
  }
}
node {
  name: "IGRAPH_nohash_kkv_k2_scence_ds_igraph"
  op: "UbParseOpV2"
  input: "AdKkvIGraphAsyncAccessOp"
  device: "/CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "parser_IGRAPH_nohash_kkv_k2_scence_ds_igraph_IGRAPH_nohash_nick_k2_all_ds_igraph_IGRAPH_nohash_nick_k2_seq_ds_igraph_IGRAPH_nohash_nick_k2_agg_profile_ds_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq_TAIR_rt_ub_50_seq_IGRAPH_rt_ub_pv_igraph_IGRAPH_rt_ub_pv_agg_igraph"
  op: "AdMultiUbFieldToTensorOpV2"
  input: "IGRAPH_nohash_kkv_k2_scence_ds_igraph"
  input: "IGRAPH_nohash_nick_k2_all_ds_igraph"
  input: "IGRAPH_nohash_nick_k2_seq_ds_igraph"
  input: "IGRAPH_nohash_nick_k2_agg_profile_ds_igraph"
  input: "TAIR_global_nick_ub_ds"
  input: "TAIR_global_nick_rtb_seq"
  input: "TAIR_rt_ub_50_seq"
  input: "IGRAPH_rt_ub_pv_igraph"
  input: "IGRAPH_rt_ub_pv_agg_igraph"
  device: "/CPU:0"
  attr {
    key: "Tin"
    value {
      list {
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "data_sources"
    value {
      list {
        i: 0
        i: 1
        i: 2
        i: 3
        i: 4
        i: 5
        i: 6
        i: 7
        i: 8
      }
    }
  }
  attr {
    key: "field_names"
    value {
      list {
        s: "nick_ecpm_shop_score"
        s: "rt_clk_item_seq"
        s: "rt_clk_cate_seq"
        s: "rt_clk_node_seq"
        s: "rt_clk_shop_seq"
        s: "rt_clk_bran_seq"
        s: "rt_clk_prod_seq"
        s: "rt_pv_cate"
        s: "rt_pv_shop"
        s: "rt_pv_node"
        s: "nick_scene_ad_clk_item_14"
        s: "nick_scene_ad_clk_item_30"
        s: "nick_scene_ad_clk_item_60"
        s: "nick_scene_ad_clk_cate_14"
        s: "nick_scene_ad_clk_cate_30"
        s: "nick_scene_ad_clk_cate_60"
        s: "nick_scene_ad_clk_node_14"
        s: "nick_scene_ad_clk_node_30"
        s: "nick_scene_ad_clk_node_60"
        s: "nick_scene_ad_clk_shop_14"
        s: "nick_scene_ad_clk_shop_30"
        s: "nick_scene_ad_clk_shop_60"
        s: "nick_scene_ad_clk_brand_14"
        s: "nick_scene_ad_clk_brand_30"
        s: "nick_scene_ad_clk_brand_60"
        s: "nick_scene_ad_clk_product_14"
        s: "nick_scene_ad_clk_product_30"
        s: "nick_scene_ad_clk_product_60"
        s: "nick_scene_ad_clk_adgroup_14"
        s: "nick_scene_ad_clk_adgroup_30"
        s: "nick_scene_ad_clk_adgroup_60"
        s: "nick_item_fav_180"
        s: "nick_cate_fav_180"
        s: "nick_node_fav_180"
        s: "nick_shop_fav_180"
        s: "nick_item_cart_180"
        s: "nick_cate_cart_180"
        s: "nick_node_cart_180"
        s: "nick_shop_cart_180"
        s: "nick_scene_ad_nonclk_item_30"
        s: "nick_scene_ad_nonclk_cate_30"
        s: "nick_scene_ad_nonclk_node_30"
        s: "nick_scene_ad_nonclk_shop_30"
        s: "nick_scene_ad_nonclk_brand_30"
        s: "nick_scene_ad_nonclk_product_30"
        s: "nick_scene_ad_nonclk_adgroup_30"
        s: "nick_ad_clk_item_14"
        s: "nick_ad_clk_item_30"
        s: "nick_ad_clk_item_60"
        s: "nick_ad_clk_cate_14"
        s: "nick_ad_clk_cate_30"
        s: "nick_ad_clk_cate_60"
        s: "nick_ad_clk_node_14"
        s: "nick_ad_clk_node_30"
        s: "nick_ad_clk_node_60"
        s: "nick_ad_clk_shop_14"
        s: "nick_ad_clk_shop_30"
        s: "nick_ad_clk_shop_60"
        s: "nick_ad_clk_brand_14"
        s: "nick_ad_clk_brand_30"
        s: "nick_ad_clk_brand_60"
        s: "nick_ad_clk_product_14"
        s: "nick_ad_clk_product_30"
        s: "nick_ad_clk_product_60"
        s: "nick_ad_clk_adgroup_14"
        s: "nick_ad_clk_adgroup_30"
        s: "nick_ad_clk_adgroup_60"
        s: "nick_ad_clk_seq_item_60"
        s: "nick_ad_clk_seq_cate_60"
        s: "nick_ad_clk_seq_node_60"
        s: "nick_ad_clk_seq_shop_60"
        s: "nick_ad_clk_seq_brand_60"
        s: "nick_ad_clk_seq_product_60"
        s: "nick_ad_nonclk_item_30"
        s: "nick_ad_nonclk_cate_30"
        s: "nick_ad_nonclk_node_30"
        s: "nick_ad_nonclk_shop_30"
        s: "nick_ad_nonclk_brand_30"
        s: "nick_ad_nonclk_product_30"
        s: "nick_ad_nonclk_adgroup_30"
        s: "nick_ad_nonclk_seq_item_30"
        s: "nick_ad_nonclk_seq_cate_30"
        s: "nick_ad_nonclk_seq_node_30"
        s: "nick_ad_nonclk_seq_shop_30"
        s: "nick_ad_nonclk_seq_brand_30"
        s: "nick_ad_nonclk_seq_product_30"
        s: "id_age_level"
        s: "id_gender"
        s: "prov_name"
        s: "city_name"
        s: "city_level"
        s: "buyer_star_name"
        s: "vip_level_name"
        s: "cms_segid"
        s: "cms_group_id"
        s: "shopping_level"
        s: "pred_is_undergraduate"
        s: "phone_model"
        s: "l1cat_prefer_long"
        s: "pred_has_house"
        s: "leafcate_prefer_long"
        s: "pred_life_stage_haschild"
        s: "pred_life_stage_married"
        s: "pred_career_type"
        s: "shop_prefer_3days"
        s: "shop_prefer_long"
        s: "tm_level"
        s: "user_pp_level"
        s: "phone_price"
        s: "phone_price_level_prefer"
