node {
  name: "nick_name"
  op: "Placeholder"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "adgroup_id"
  op: "Placeholder"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "refpid"
  op: "Placeholder"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "session_id"
  op: "Placeholder"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "timestamp"
  op: "Placeholder"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_UINT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "pid"
  op: "Placeholder"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "AdIGraphAsyncAccessOpV2"
  op: "AdIGraphAsyncAccessOpV2"
  input: "nick_name"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "ds_conf_key"
    value {
      list {
        s: "IGRAPH_nohash_nick_dqm_binary_kvfea_igraph"
      }
    }
  }
}
node {
  name: "IGRAPH_nohash_nick_dqm_binary_kvfea_igraph"
  op: "UbParseOpV2"
  input: "AdIGraphAsyncAccessOpV2"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "AdTairAsyncAccessOp"
  op: "AdTairAsyncAccessOp"
  input: "nick_name"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "ds_conf_key"
    value {
      s: "TAIR_global_nick_ub_ds"
    }
  }
  attr {
    key: "fea_list"
    value {
      s: ""
    }
  }
}
node {
  name: "TAIR_global_nick_ub_ds"
  op: "UbParseOpV2"
  input: "AdTairAsyncAccessOp"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "AdTairAsyncAccessOp_1"
  op: "AdTairAsyncAccessOp"
  input: "nick_name"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "ds_conf_key"
    value {
      s: "TAIR_global_nick_rtb_seq"
    }
  }
  attr {
    key: "fea_list"
    value {
      s: ""
    }
  }
}
node {
  name: "TAIR_global_nick_rtb_seq"
  op: "UbParseOpV2"
  input: "AdTairAsyncAccessOp_1"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "non_fetch_Context"
  op: "ContextToTensorOp"
  input: "pid"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "Tin"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "table"
    value {
      s: "user"
    }
  }
}
node {
  name: "lookup_pk_k2_ad_realtime_hash_key"
  op: "AdLookupPkOp"
  input: "adgroup_id"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "tableName"
    value {
      s: "k2_ad_realtime_hash"
    }
  }
}
node {
  name: "fetch_adgroup_id"
  op: "AdAttributeToTensorBatchOpV2"
  input: "lookup_pk_k2_ad_realtime_hash_key"
  input: "lookup_pk_k2_ad_realtime_hash_key:1"
  input: "lookup_pk_k2_ad_realtime_hash_key:2"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      list {
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "attribute_max_sizes"
    value {
      list {
        i: -1
        i: -1
        i: -1
        i: -1
        i: -1
        i: -1
      }
    }
  }
  attr {
    key: "attribute_names"
    value {
      list {
        s: "k2_ad_realtime_hash:_dii_reserved_pack_attribute:ad_feedback_total_pv_mock_dense"
        s: "k2_ad_realtime_hash:_dii_reserved_pack_attribute:ad_feedback_total_clk_mock_dense"
        s: "k2_ad_realtime_hash:_dii_reserved_pack_attribute:ad_feedback_explore_type_mock_dense"
        s: "k2_ad_realtime_hash:_dii_reserved_pack_attribute:ad_feedback_create_time"
        s: "k2_ad_realtime_hash:_dii_reserved_pack_attribute:ad_feedback_create_duration"
        s: "k2_ad_realtime_hash:_dii_reserved_pack_attribute:version"
      }
    }
  }
  attr {
    key: "padding_fields"
    value {
      list {
        s: "k2_ad_realtime_hash:_dii_reserved_pack_attribute:ad_feedback_total_pv_mock_dense"
        s: "k2_ad_realtime_hash:_dii_reserved_pack_attribute:ad_feedback_total_clk_mock_dense"
        s: "k2_ad_realtime_hash:_dii_reserved_pack_attribute:ad_feedback_explore_type_mock_dense"
        s: "k2_ad_realtime_hash:_dii_reserved_pack_attribute:ad_feedback_create_time"
        s: "k2_ad_realtime_hash:_dii_reserved_pack_attribute:ad_feedback_create_duration"
        s: "k2_ad_realtime_hash:_dii_reserved_pack_attribute:version"
      }
    }
  }
  attr {
    key: "string_float_pairs_attributes"
    value {
      list {
      }
    }
  }
}
node {
  name: "lookup_pk_k2_hash_nmd_key"
  op: "AdLookupPkOp"
  input: "adgroup_id"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "tableName"
    value {
      s: "k2_hash_nmd"
    }
  }
}
node {
  name: "fetch_adgroup_id_1"
  op: "AdAttributeToTensorBatchOpV2"
  input: "lookup_pk_k2_hash_nmd_key"
  input: "lookup_pk_k2_hash_nmd_key:1"
  input: "lookup_pk_k2_hash_nmd_key:2"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      list {
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "attribute_max_sizes"
    value {
      list {
        i: -1
        i: -1
        i: -1
        i: -1
        i: -1
        i: -1
        i: -1
        i: -1
        i: -1
      }
    }
  }
  attr {
    key: "attribute_names"
    value {
      list {
        s: "k2_hash_nmd:_dii_reserved_pack_attribute:adgroup_id"
        s: "k2_hash_nmd:_dii_reserved_pack_attribute:campaign_id"
        s: "k2_hash_nmd:_dii_reserved_pack_attribute:member_id"
        s: "k2_hash_nmd:_dii_reserved_pack_attribute:ad_item_id"
        s: "k2_hash_nmd:_dii_reserved_pack_attribute:ad_cate_id"
        s: "k2_hash_nmd:_dii_reserved_pack_attribute:ad_shop_id"
        s: "k2_hash_nmd:_dii_reserved_pack_attribute:ad_node_id"
        s: "k2_hash_nmd:_dii_reserved_pack_attribute:ad_item_product"
        s: "k2_hash_nmd:_dii_reserved_pack_attribute:ad_item_brand"
      }
    }
  }
  attr {
    key: "padding_fields"
    value {
      list {
      }
    }
  }
  attr {
    key: "string_float_pairs_attributes"
    value {
      list {
      }
    }
  }
}
node {
  name: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq"
  op: "AdMultiUbFieldToTensorOpV2"
  input: "IGRAPH_nohash_nick_dqm_binary_kvfea_igraph"
  input: "TAIR_global_nick_ub_ds"
  input: "TAIR_global_nick_rtb_seq"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "Tin"
    value {
      list {
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "data_sources"
    value {
      list {
        i: 0
        i: 1
        i: 2
      }
    }
  }
  attr {
    key: "field_names"
    value {
      list {
        s: "rt_pv_cate"
        s: "rt_pv_shop"
        s: "rt_pv_node"
        s: "nick_ad_clk_shop_60"
        s: "nick_ad_clk_adgroup_60"
        s: "nick_ad_nonclk_shop_30"
        s: "nick_ad_nonclk_adgroup_30"
        s: "nick_cate_pv_21"
        s: "nick_shop_pv_21"
        s: "nick_brand_pv_21"
        s: "nick_product_pv_21"
        s: "nick_cate_fav_21"
        s: "nick_cate_buy_21"
        s: "nick_ecpm_shop_score"
      }
    }
  }
}
node {
  name: "feature_generate"
  op: "FeatureGeneratorOp"
  input: "fetch_adgroup_id_1:2"
  input: "fetch_adgroup_id_1"
  input: "fetch_adgroup_id_1:1"
  input: "fetch_adgroup_id_1:5"
  input: "fetch_adgroup_id_1:3"
  input: "fetch_adgroup_id_1:4"
  input: "fetch_adgroup_id_1:8"
  input: "fetch_adgroup_id_1:6"
  input: "fetch_adgroup_id_1:7"
  input: "fetch_adgroup_id_1:11"
  input: "fetch_adgroup_id_1:9"
  input: "fetch_adgroup_id_1:10"
  input: "fetch_adgroup_id_1:14"
  input: "fetch_adgroup_id_1:12"
  input: "fetch_adgroup_id_1:13"
  input: "fetch_adgroup_id_1:17"
  input: "fetch_adgroup_id_1:15"
  input: "fetch_adgroup_id_1:16"
  input: "fetch_adgroup_id_1:20"
  input: "fetch_adgroup_id_1:18"
  input: "fetch_adgroup_id_1:19"
  input: "fetch_adgroup_id_1:23"
  input: "fetch_adgroup_id_1:21"
  input: "fetch_adgroup_id_1:22"
  input: "fetch_adgroup_id_1:26"
  input: "fetch_adgroup_id_1:24"
  input: "fetch_adgroup_id_1:25"
  input: "non_fetch_Context:2"
  input: "non_fetch_Context"
  input: "non_fetch_Context:1"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:2"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:1"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:5"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:3"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:4"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:8"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:6"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:7"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:11"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:9"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:10"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:14"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:12"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:13"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:17"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:15"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:16"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:20"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:18"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:19"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:23"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:21"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:22"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:26"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:24"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:25"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:29"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:27"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:28"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:32"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:30"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:31"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:35"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:33"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:34"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:38"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:36"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:37"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:41"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:39"
  input: "parser_IGRAPH_nohash_nick_dqm_binary_kvfea_igraph_TAIR_global_nick_ub_ds_TAIR_global_nick_rtb_seq:40"
  device: "/job:item.dqm_ltr_ndcg_lite_nmd_npu_turing/replica:0/task:0/device:CPU:0"
  attr {
    key: "Tin"
    value {
      list {
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
        type: DT_INT32
        type: DT_INT64
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "compact_output"
    value {
      b: false
    }
  }
  attr {
    key: "fg_json"
    value {
