node {
  name: "place_holder_for_SparseTensorPackOp_0"
  op: "Placeholder"
  device: "/CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "RapidEmbeddingOp_1"
  op: "RapidEmbeddingOp"
  input: "place_holder_for_SparseTensorPackOp_0"
  device: "/CPU:0"
  attr {
    key: "Tin"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "embed_json"
    value {
      s: "{\"feature_source\": {\"output_type_suffix\": {\"indices\": \"_indices\", \"keys\": \"_keys\", \"values\": \"_values\"}, \"feature_desc\": [{\"select_fields\": [\"nick_cate_pv_3\", \"nick_cate_fav_3\", \"nick_cate_buy_3\", \"nick_shop_pv_3\", \"nick_node_pv_3\", \"nick_item_pv_14\", \"nick_node_pv_14\", \"nick_cate_pv_14\", \"nick_shop_pv_14\", \"nick_cate_fav_14\", \"nick_cate_buy_14\", \"nick_product_pv_14\", \"nick_brand_pv_14\", \"nick_hashnode_pv_14\", \"wtleafcate_clk_7\", \"wtleafcate_clk_30\", \"wtleafcate_clk_60\", \"wtleafcate_noclkpv_7\", \"wtleafcate_noclkpv_30\", \"wtleafcate_noclkpv_60\", \"wttopcate_clk_7\", \"wttopcate_clk_30\", \"wttopcate_clk_60\", \"wttopcate_noclkpv_7\", \"wttopcate_noclkpv_30\", \"wttopcate_noclkpv_60\", \"wtshop_clk_7\", \"wtshop_clk_30\", \"wtshop_clk_60\", \"wtshop_noclkpv_7\", \"wtshop_noclkpv_30\", \"wtshop_noclkpv_60\", \"wtnode_clk_7\", \"wtnode_clk_30\", \"wtnode_clk_60\", \"wtnode_noclkpv_7\", \"wtnode_noclkpv_30\", \"wtnode_noclkpv_60\", \"cms_segid\", \"cms_group_id\", \"final_gender_code\", \"age_level\", \"pvalue_level\", \"shopping_level\", \"occupation\", \"new_user_class_level\", \"last_shoutao_day\", \"last_shoutao\", \"pred_life_stage\", \"pred_income_level\", \"pred_purchase_power\", \"is_vip\", \"career\", \"common_receive_province_id_180d\", \"discount_sensitive\", \"pred_life_stage_married\", \"interest_group\", \"common_receive_city_level_180d\", \"brand_prefer\", \"shop_prefer\", \"clk_cate_leaf_prefer\", \"pay_cate_level1_prefer_30d\", \"clk_cate_level1_prefer\", \"buyer_star_name\", \"pred_education_degree\", \"wtk2_tool_cate_clk_7d\", \"wtk2_tool_cate_clk_56d\", \"wtk2_tool_cate_noclk_7d\", \"wtk2_tool_cate_noclk_56d\", \"wtk2_tool_brand_clk_7d\", \"wtk2_tool_brand_clk_56d\", \"wtk2_tool_brand_noclk_7d\", \"wtk2_tool_brand_noclk_56d\", \"wtk2_svideo_cate_clk_7d\", \"wtk2_svideo_cate_clk_56d\", \"wtk2_svideo_cate_noclk_7d\", \"wtk2_svideo_cate_noclk_56d\", \"wtk2_svideo_brand_clk_7d\", \"wtk2_svideo_brand_clk_56d\", \"wtk2_svideo_brand_noclk_7d\", \"wtk2_svideo_brand_noclk_56d\", \"wtk2_mvideo_cate_clk_7d\", \"wtk2_mvideo_cate_clk_56d\", \"wtk2_mvideo_cate_noclk_7d\", \"wtk2_mvideo_cate_noclk_56d\", \"wtk2_mvideo_brand_clk_7d\", \"wtk2_mvideo_brand_clk_56d\", \"wtk2_mvideo_brand_noclk_7d\", \"wtk2_mvideo_brand_noclk_56d\", \"wtk2_infoflow_cate_clk_7d\", \"wtk2_infoflow_cate_clk_56d\", \"wtk2_infoflow_cate_noclk_7d\", \"wtk2_infoflow_cate_noclk_56d\", \"wtk2_infoflow_brand_clk_7d\", \"wtk2_infoflow_brand_clk_56d\", \"wtk2_infoflow_brand_noclk_7d\", \"wtk2_infoflow_brand_noclk_56d\", \"wtk2_openscreen_cate_clk_7d\", \"wtk2_openscreen_cate_clk_56d\", \"wtk2_openscreen_cate_noclk_7d\", \"wtk2_openscreen_cate_noclk_56d\", \"wtk2_openscreen_brand_clk_7d\", \"wtk2_openscreen_brand_clk_56d\", \"wtk2_openscreen_brand_noclk_7d\", \"wtk2_openscreen_brand_noclk_56d\", \"wtk2_other_cate_clk_7d\", \"wtk2_other_cate_clk_56d\", \"wtk2_other_cate_noclk_7d\", \"wtk2_other_cate_noclk_56d\", \"wtk2_other_brand_clk_7d\", \"wtk2_other_brand_clk_56d\", \"wtk2_other_brand_noclk_7d\", \"wtk2_other_brand_noclk_56d\", \"wtk2_None_cate_clk_7d\", \"wtk2_None_cate_clk_56d\", \"wtk2_None_cate_noclk_7d\", \"wtk2_None_cate_noclk_56d\", \"wtk2_None_brand_clk_7d\", \"wtk2_None_brand_clk_56d\", \"wtk2_None_brand_noclk_7d\", \"wtk2_None_brand_noclk_56d\", \"wt_vip_level_name\", \"wt_tq_level_vip\", \"wt_tq_level\", \"wt_tm365buy\", \"wt_tm_level\", \"wt_tb365std_buy\", \"wt_phone_use_month\", \"wt_mt4user\", \"wt_id_age\", \"wt_d7_shoutao\", \"wt_d30_shoutao\", \"wt_ad_clk\", \"adzoneid_clk_30\", \"adzoneid_clk_60\", \"adzoneid_noclkpv_30\", \"adzoneid_noclkpv_60\", \"wtmtcmadleafcate_clk_30\", \"wtmtcmadleafcate_noclkpv_30\", \"wtmtcmadmaincate_clk_30\", \"wtmtcmadmaincate_noclkpv_30\", \"wtmtcmadshop_clk_30\", \"wtmtcmadshop_noclkpv_30\", \"wtmtcmadbrand_clk_30\", \"wtmtcmadbrand_noclkpv_30\", \"wtmtcmadnode_clk_30\", \"wtmtcmadnode_noclkpv_30\", \"rt_pv_item_seq\", \"rt_pv_cate_seq\", \"rt_pv_shop_seq\", \"rt_pv_node_seq\", \"rt_pv_product_seq\", \"rt_pv_brand_seq\"], \"tair_igraph_table\": {\"nick_table\": [\"fund_wt_shark_nick_indexfea_table_subset_hash\", \"fund_wt_exp_user_feature_raw_binary_hash\", \"fund_wt_union_user_action_feature_tosubset_v1\", \"wt_itemjump_user_feature_hash\", \"global_nick_ub_ds\", \"global_nick_rtb_seq\"]}, \"from_table\": \"user\"}, {\"select_fields\": [\"adgroup_id\", \"ad_src\"], \"from_table\": \"ad_context\"}, {\"select_fields\": [\"campaign_id\", \"customer_id\", \"ad_item_id\", \"ad_cate_id\", \"ad_shop_id\", \"ad_node_id\", \"ad_hashnode_id\", \"ad_item_user_type\", \"ad_item_city\", \"ad_item_prov\", \"ad_item_product\", \"ad_item_brand\", \"wt_cate_level1_id\", \"wt_new_main_cate_id\"], \"key\": \"adgroup_id\", \"from_table\": \"waitou_ad_feature_hash\"}, {\"select_fields\": [\"pid\", \"hour\", \"workday\", \"weekend\", \"member_id\", \"site_id\", \"adzone_id\"], \"from_table\": \"context\"}, {\"select_fields\": [\"os_type\", \"manual_label\", \"site_type_id\", \"bus_type\"], \"key\": \"pid\", \"from_table\": \"wt_itemjump_context_feature_index\"}]}, \"features\": [{\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_cate_pv_3\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"109_3\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_cate_fav_3\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"113_3\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_cate_buy_3\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"117_3\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_shop_pv_3\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"110_3\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_node_pv_3\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"108_3\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_item_pv_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"107_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_node_pv_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"108_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_cate_pv_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"109_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_shop_pv_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"110_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_cate_fav_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"113_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_cate_buy_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"117_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_product_pv_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"126_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_brand_pv_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"127_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"nick_hashnode_pv_14\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"150_14\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtleafcate_clk_7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"350_7\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtleafcate_clk_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"350_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtleafcate_clk_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"350_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtleafcate_noclkpv_7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"351_7\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtleafcate_noclkpv_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"351_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtleafcate_noclkpv_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"351_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wttopcate_clk_7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"352_7\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wttopcate_clk_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"352_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wttopcate_clk_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"352_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wttopcate_noclkpv_7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"353_7\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wttopcate_noclkpv_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"353_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wttopcate_noclkpv_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"353_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtshop_clk_7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"354_7\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtshop_clk_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"354_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtshop_clk_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"354_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtshop_noclkpv_7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"355_7\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtshop_noclkpv_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"355_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtshop_noclkpv_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"355_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtnode_clk_7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"356_7\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtnode_clk_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"356_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtnode_clk_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"356_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtnode_noclkpv_7\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"357_7\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtnode_noclkpv_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"357_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtnode_noclkpv_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"357_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"cms_segid\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"121\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"cms_group_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"122\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"final_gender_code\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"124\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"age_level\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"125\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"pvalue_level\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"126\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"shopping_level\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"127\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"occupation\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"128\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"new_user_class_level\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"129\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"last_shoutao_day\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"140\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"last_shoutao\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"141\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"pred_life_stage\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1104\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"pred_income_level\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1108\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"pred_purchase_power\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1112\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"is_vip\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1114\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"career\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1115\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"common_receive_province_id_180d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1119\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"discount_sensitive\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1122\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"pred_life_stage_married\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1123\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"interest_group\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1124\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"common_receive_city_level_180d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1125\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"brand_prefer\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1128\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"shop_prefer\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1129\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"clk_cate_leaf_prefer\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1130\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"pay_cate_level1_prefer_30d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1131\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"clk_cate_level1_prefer\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1132\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"buyer_star_name\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1134\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"pred_education_degree\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1135\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_tool_cate_clk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4400\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_tool_cate_clk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4401\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_tool_cate_noclk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4402\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_tool_cate_noclk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4403\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_tool_brand_clk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4404\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_tool_brand_clk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4405\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_tool_brand_noclk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4406\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_tool_brand_noclk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4407\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_svideo_cate_clk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4412\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_svideo_cate_clk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4413\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_svideo_cate_noclk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4414\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_svideo_cate_noclk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4415\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_svideo_brand_clk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4416\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_svideo_brand_clk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4417\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_svideo_brand_noclk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4418\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_svideo_brand_noclk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4419\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_mvideo_cate_clk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4424\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_mvideo_cate_clk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4425\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_mvideo_cate_noclk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4426\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_mvideo_cate_noclk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4427\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_mvideo_brand_clk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4428\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_mvideo_brand_clk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4429\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_mvideo_brand_noclk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4430\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_mvideo_brand_noclk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4431\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_infoflow_cate_clk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4436\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_infoflow_cate_clk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4437\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_infoflow_cate_noclk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4438\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_infoflow_cate_noclk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4439\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_infoflow_brand_clk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4440\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_infoflow_brand_clk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4441\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_infoflow_brand_noclk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4442\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_infoflow_brand_noclk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4443\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_openscreen_cate_clk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4448\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_openscreen_cate_clk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4449\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_openscreen_cate_noclk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4450\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_openscreen_cate_noclk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4451\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_openscreen_brand_clk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4452\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_openscreen_brand_clk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4453\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_openscreen_brand_noclk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4454\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_openscreen_brand_noclk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4455\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_other_cate_clk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4460\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_other_cate_clk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4461\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_other_cate_noclk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4462\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_other_cate_noclk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4463\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_other_brand_clk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4464\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_other_brand_clk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4465\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_other_brand_noclk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4466\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_other_brand_noclk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4467\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_None_cate_clk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4472\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_None_cate_clk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4473\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_None_cate_noclk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4474\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_None_cate_noclk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4475\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_None_brand_clk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4476\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_None_brand_clk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4477\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_None_brand_noclk_7d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4478\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtk2_None_brand_noclk_56d\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"4479\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"adgroup_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"201\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"campaign_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"203\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"customer_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"204\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_item_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"205\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_cate_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"206\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_shop_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"207\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_node_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"208\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_hashnode_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"210\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_item_user_type\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"212\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_item_city\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"213\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_item_prov\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"214\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_item_product\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"215\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_item_brand\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"216\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"wt_cate_level1_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"218\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"wt_new_main_cate_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"226\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"pid\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"301\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"hour\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"302\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"workday\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"303\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"weekend\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"304\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"member_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"305\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"site_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"306\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"adzone_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"307\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"os_type\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"309\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"manual_label\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"310\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"site_type_id\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"311\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"bus_type\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"312\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"ad_src\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"330\", \"fg_table\": \"ad\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"wt_vip_level_name\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1201\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"wt_tq_level_vip\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1202\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"wt_tq_level\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1203\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"wt_tm365buy\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1204\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"wt_tm_level\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1205\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"wt_tb365std_buy\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1206\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"wt_phone_use_month\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1207\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"wt_mt4user\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1208\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"wt_id_age\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1210\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"wt_d7_shoutao\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1211\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"wt_d30_shoutao\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1212\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_id\", \"feature_name\": \"wt_ad_clk\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1213\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"adzoneid_clk_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"282_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"adzoneid_clk_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"282_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"adzoneid_noclkpv_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"283_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"adzoneid_noclkpv_60\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"283_60\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtmtcmadleafcate_clk_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"365_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtmtcmadleafcate_noclkpv_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"366_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtmtcmadmaincate_clk_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"380_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtmtcmadmaincate_noclkpv_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"367_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtmtcmadshop_clk_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"368_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtmtcmadshop_noclkpv_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"369_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtmtcmadbrand_clk_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"370_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtmtcmadbrand_noclkpv_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"371_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtmtcmadnode_clk_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"374_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_behavior\", \"feature_name\": \"wtmtcmadnode_noclkpv_30\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"375_30\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"rt_pv_item_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1600\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"rt_pv_cate_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1601\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"rt_pv_shop_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1602\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"rt_pv_node_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1603\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"rt_pv_product_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1604\", \"fg_table\": \"user\"}, {\"parse_function\": \"parse_sequence\", \"feature_name\": \"rt_pv_brand_seq\", \"feature_type\": \"id_feature\", \"feature_group_id\": \"1605\", \"fg_table\": \"user\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_cate_id_and_wtleafcate_clk_7\", \"arguments\": [\"ad_cate_id\", \"wtleafcate_clk_7\"], \"feature_group_id\": \"601_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_cate_id_and_wtleafcate_clk_30\", \"arguments\": [\"ad_cate_id\", \"wtleafcate_clk_30\"], \"feature_group_id\": \"601_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_cate_id_and_wtleafcate_clk_60\", \"arguments\": [\"ad_cate_id\", \"wtleafcate_clk_60\"], \"feature_group_id\": \"601_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_cate_id_and_wtleafcate_clk_7\", \"arguments\": [\"ad_cate_id\", \"wtleafcate_clk_7\"], \"feature_group_id\": \"602_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_cate_id_and_wtleafcate_clk_30\", \"arguments\": [\"ad_cate_id\", \"wtleafcate_clk_30\"], \"feature_group_id\": \"602_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_cate_id_and_wtleafcate_clk_60\", \"arguments\": [\"ad_cate_id\", \"wtleafcate_clk_60\"], \"feature_group_id\": \"602_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_cate_id_and_wtleafcate_noclkpv_7\", \"arguments\": [\"ad_cate_id\", \"wtleafcate_noclkpv_7\"], \"feature_group_id\": \"603_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_cate_id_and_wtleafcate_noclkpv_30\", \"arguments\": [\"ad_cate_id\", \"wtleafcate_noclkpv_30\"], \"feature_group_id\": \"603_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_cate_id_and_wtleafcate_noclkpv_60\", \"arguments\": [\"ad_cate_id\", \"wtleafcate_noclkpv_60\"], \"feature_group_id\": \"603_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_cate_id_and_wtleafcate_noclkpv_7\", \"arguments\": [\"ad_cate_id\", \"wtleafcate_noclkpv_7\"], \"feature_group_id\": \"604_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_cate_id_and_wtleafcate_noclkpv_30\", \"arguments\": [\"ad_cate_id\", \"wtleafcate_noclkpv_30\"], \"feature_group_id\": \"604_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_cate_id_and_wtleafcate_noclkpv_60\", \"arguments\": [\"ad_cate_id\", \"wtleafcate_noclkpv_60\"], \"feature_group_id\": \"604_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_wt_cate_level1_id_and_wttopcate_clk_7\", \"arguments\": [\"wt_cate_level1_id\", \"wttopcate_clk_7\"], \"feature_group_id\": \"605_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_wt_cate_level1_id_and_wttopcate_clk_30\", \"arguments\": [\"wt_cate_level1_id\", \"wttopcate_clk_30\"], \"feature_group_id\": \"605_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_wt_cate_level1_id_and_wttopcate_clk_60\", \"arguments\": [\"wt_cate_level1_id\", \"wttopcate_clk_60\"], \"feature_group_id\": \"605_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_wt_cate_level1_id_and_wttopcate_clk_7\", \"arguments\": [\"wt_cate_level1_id\", \"wttopcate_clk_7\"], \"feature_group_id\": \"606_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_wt_cate_level1_id_and_wttopcate_clk_30\", \"arguments\": [\"wt_cate_level1_id\", \"wttopcate_clk_30\"], \"feature_group_id\": \"606_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_wt_cate_level1_id_and_wttopcate_clk_60\", \"arguments\": [\"wt_cate_level1_id\", \"wttopcate_clk_60\"], \"feature_group_id\": \"606_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_wt_cate_level1_id_and_wttopcate_noclkpv_7\", \"arguments\": [\"wt_cate_level1_id\", \"wttopcate_noclkpv_7\"], \"feature_group_id\": \"607_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_wt_cate_level1_id_and_wttopcate_noclkpv_30\", \"arguments\": [\"wt_cate_level1_id\", \"wttopcate_noclkpv_30\"], \"feature_group_id\": \"607_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_wt_cate_level1_id_and_wttopcate_noclkpv_60\", \"arguments\": [\"wt_cate_level1_id\", \"wttopcate_noclkpv_60\"], \"feature_group_id\": \"607_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_wt_cate_level1_id_and_wttopcate_noclkpv_7\", \"arguments\": [\"wt_cate_level1_id\", \"wttopcate_noclkpv_7\"], \"feature_group_id\": \"608_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_wt_cate_level1_id_and_wttopcate_noclkpv_30\", \"arguments\": [\"wt_cate_level1_id\", \"wttopcate_noclkpv_30\"], \"feature_group_id\": \"608_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_wt_cate_level1_id_and_wttopcate_noclkpv_60\", \"arguments\": [\"wt_cate_level1_id\", \"wttopcate_noclkpv_60\"], \"feature_group_id\": \"608_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_shop_id_and_wtshop_clk_7\", \"arguments\": [\"ad_shop_id\", \"wtshop_clk_7\"], \"feature_group_id\": \"609_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_shop_id_and_wtshop_clk_30\", \"arguments\": [\"ad_shop_id\", \"wtshop_clk_30\"], \"feature_group_id\": \"609_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_shop_id_and_wtshop_clk_60\", \"arguments\": [\"ad_shop_id\", \"wtshop_clk_60\"], \"feature_group_id\": \"609_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_shop_id_and_wtshop_clk_7\", \"arguments\": [\"ad_shop_id\", \"wtshop_clk_7\"], \"feature_group_id\": \"610_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_shop_id_and_wtshop_clk_30\", \"arguments\": [\"ad_shop_id\", \"wtshop_clk_30\"], \"feature_group_id\": \"610_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_shop_id_and_wtshop_clk_60\", \"arguments\": [\"ad_shop_id\", \"wtshop_clk_60\"], \"feature_group_id\": \"610_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_shop_id_and_wtshop_noclkpv_7\", \"arguments\": [\"ad_shop_id\", \"wtshop_noclkpv_7\"], \"feature_group_id\": \"611_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_shop_id_and_wtshop_noclkpv_30\", \"arguments\": [\"ad_shop_id\", \"wtshop_noclkpv_30\"], \"feature_group_id\": \"611_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_shop_id_and_wtshop_noclkpv_60\", \"arguments\": [\"ad_shop_id\", \"wtshop_noclkpv_60\"], \"feature_group_id\": \"611_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_shop_id_and_wtshop_noclkpv_7\", \"arguments\": [\"ad_shop_id\", \"wtshop_noclkpv_7\"], \"feature_group_id\": \"612_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_shop_id_and_wtshop_noclkpv_30\", \"arguments\": [\"ad_shop_id\", \"wtshop_noclkpv_30\"], \"feature_group_id\": \"612_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_shop_id_and_wtshop_noclkpv_60\", \"arguments\": [\"ad_shop_id\", \"wtshop_noclkpv_60\"], \"feature_group_id\": \"612_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_node_id_and_wtnode_clk_7\", \"arguments\": [\"ad_node_id\", \"wtnode_clk_7\"], \"feature_group_id\": \"613_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_node_id_and_wtnode_clk_30\", \"arguments\": [\"ad_node_id\", \"wtnode_clk_30\"], \"feature_group_id\": \"613_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_node_id_and_wtnode_clk_60\", \"arguments\": [\"ad_node_id\", \"wtnode_clk_60\"], \"feature_group_id\": \"613_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_node_id_and_wtnode_clk_7\", \"arguments\": [\"ad_node_id\", \"wtnode_clk_7\"], \"feature_group_id\": \"614_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_node_id_and_wtnode_clk_30\", \"arguments\": [\"ad_node_id\", \"wtnode_clk_30\"], \"feature_group_id\": \"614_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_node_id_and_wtnode_clk_60\", \"arguments\": [\"ad_node_id\", \"wtnode_clk_60\"], \"feature_group_id\": \"614_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_node_id_and_wtnode_noclkpv_7\", \"arguments\": [\"ad_node_id\", \"wtnode_noclkpv_7\"], \"feature_group_id\": \"615_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_node_id_and_wtnode_noclkpv_30\", \"arguments\": [\"ad_node_id\", \"wtnode_noclkpv_30\"], \"feature_group_id\": \"615_30\", \"fg_table\": \"ad\"}, {\"combiner\": \"sum\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"Sum_colon_ad_node_id_and_wtnode_noclkpv_60\", \"arguments\": [\"ad_node_id\", \"wtnode_noclkpv_60\"], \"feature_group_id\": \"615_60\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_node_id_and_wtnode_noclkpv_7\", \"arguments\": [\"ad_node_id\", \"wtnode_noclkpv_7\"], \"feature_group_id\": \"616_7\", \"fg_table\": \"ad\"}, {\"combiner\": \"id\", \"feature_type\": \"combined_feature\", \"parse_function\": \"set_match\", \"feature_name\": \"ID_colon_ad_node_id_and_wtnode_noclkpv_30\", 